export interface Question {
  id: number;
  question: string;
  options: string[];
  correctAnswer: string;
}

export const questions: Question[] = [
  {
    id: 1,
    question: "যদি $A=[[1,2],$ [3, 4]], তবে $A^{2}$ কত?",
    options: ["[[7, 10], [15, 22]]", "[[2, 4], [6, 8]]", "[[1, 0], [0, 1]]", "[[10, 14], [21, 30]]", "[[5, 6], [7, 8]]"],
    correctAnswer: "[[7, 10], [15, 22]]"
  },
  {
    id: 2,
    question: "[[3, 5], [-2, 4]] এর নির্ণায়ক কত?",
    options: ["22", "17", "6", "-22", "1"],
    correctAnswer: "22"
  },
  {
    id: 3,
    question: "A = [[2, 0], [1, 3]], তবে A¹ কত?",
    options: ["[[3/5, 0], [-1/5, 2/5]]", "[[3, 0], [-1, 2]]", "[[3/2, 0], [-1/2, 1]]", "[[3/2, 0], [1/2, 1]]", "[[3/2, 1/2], [0, 1]]"],
    correctAnswer: "[[3/2, 0], [-1/2, 1]]"
  },
  {
    id: 4,
    question: "কোন ম্যাট্রিক্স সবসময় নিজ ট্রান্সপোজের সমান হয়?",
    options: ["ব্যতিক্রম ম্যাট্রিক্স", "ব্যাবর ম্যাট্রিক্স", "অ্যান্টি-সিমেট্রিক", "সিমেট্রিক", "ডায়াগোনাল"],
    correctAnswer: "সিমেট্রিক"
  },
  {
    id: 5,
    question: "একটি 2×2 ম্যাট্রিক্সের নির্ণায়ক শূন্য হলে, ম্যাট্রিক্সটি কেমন?",
    options: ["ইনভার্টিবল", "সিংগুলার", "ইউনিট", "ডায়াগোনাল", "স্কেলার"],
    correctAnswer: "সিংগুলার"
  },
  {
    id: 6,
    question: "ম্যাট্রিক্স A এর ইনভার্স বিদ্যমান যদি:",
    options: ["|A|=0", "|A|≠0", "A ব্যাবর ম্যাট্রিক্স হয়", "A স্কেলার হয়", "A ট্রায়াঙ্গুলার হয়"],
    correctAnswer: "|A|≠0"
  },
   {
    id: 7,
    question: "A = [[a, b], [c, d]] হলে, এর ইনভার্স:",
    options: ["1/(ad-bc)  [[d, -b], [-c, a]]", "1/(ad-bc) x [[a, b], [c, d]", "1/(ad+bc) x [[d, -c], [-b, a]]", "[[a, b], [-c, d]]", "[[d, c], [b, a]]"],
    correctAnswer: "1/(ad-bc)  [[d, -b], [-c, a]]"
  },
  {
    id: 8,
    question: "কোন ম্যাট্রিক্সের ট্রান্সপোজ আবার ট্রান্সপোজ করলে কী হয়?",
    options: ["নির্ণায়ক পরিবর্তন হয়", "মূল ম্যাট্রিক্স ফিরে আসে", "ইনভার্স হয়", "স্কেলার হয়", "ইউনিট ম্যাট্রিক্স হয়"],
    correctAnswer: "মূল ম্যাট্রিক্স ফিরে আসে"
  },
  {
    id: 9,
    question: "ম্যাট্রিক্স গুণে কমিউটেটিভ প্রপার্টি কবে প্রযোজ্য?",
    options: ["সব সময়", "কখনো না", "শুধুমাত্র ডায়াগোনাল ম্যাট্রিক্সে", "নির্দিষ্ট ক্ষেত্রে", "ইউনিট ম্যাট্রিক্সে"],
    correctAnswer: "নির্দিষ্ট ক্ষেত্রে"
  },
  {
    id: 10,
    question: "$A\times A^{-1}=?$",
    options: ["0", "A", "$A^{-1}$", "I", "$A^{2}$"],
    correctAnswer: "I"
  },
  {
    id: 11,
    question: "যদি একটি ম্যাট্রিক্স স্কয়ার এবং স্কেলার হয়, তবে এটি কোন ধরণের ম্যাট্রিক্স?",
    options: ["ইউনিট", "সিমেট্রিক", "ডায়াগোনাল", "ইনভার্টিবল", "সিংগুলার"],
    correctAnswer: "ইউনিট"
  },
  {
    id: 12,
    question: "যদি $AB=AC$ এবং $A≠0$, তবে কি বলা যায়?",
    options: ["$B=C$", "$B≠C$", "সবসময় সঠিক", "A ইনভার্টিবল হতে হবে", "B এবং C নির্ণায়ক সমান"],
    correctAnswer: "A ইনভার্টিবল হতে হবে"
  },
  {
    id: 13,
    question: "কোন ম্যাট্রিক্সের ইনভার্স থাকতে পারে না?",
    options: ["$|A|≠0$", "$|A|=0$", "A ইউনিট ম্যাট্রিক্স", "A সিমেট্রিক", "A ডায়াগোনাল"],
    correctAnswer: "$|A|=0$"
  },
  {
   id: 14,
   question: "একটি ৩x৩ স্কয়ার ম্যাট্রিক্সের নির্ণায়ক কত উপাদানে নির্ভর করে?",
   options: ["৬", "৯", "৩", "২", "৫"],
   correctAnswer: "৯"
  },
  {
    id: 15,
    question: "যদি A একটি স্কেলার ম্যাট্রিক্স হয় তবে  $A=?$",
    options: ["al", "0", "1", "$A^{-1}$", "$A^{2}$"],
    correctAnswer: "al"
  },
  {
    id: 16,
    question: "একটি ইউনিট ম্যাট্রিক্স এর গুণফল কেমন হয়?",
    options: ["যে কোন ম্যাট্রিক্স", "I", "0", "ডায়াগোনাল", "ইনভার্স"],
    correctAnswer: "I"
  },
  {
    id: 17,
    question: "যদি A একটি ইনভার্টিবল ম্যাট্রিক্স হয়, তবে $(A^{-1})^{-1}=$",
    options: ["0", "$A^{-2}$", "A", "I", "$A^{2}$"],
    correctAnswer: "A"
  },
  {
    id: 18,
    question: "A এবং B ইনভার্টিবল হলে, $(AB)^{-1}=$",
    options: ["$A^{-1}B^{-1}$", "$B^{-1}A^{-1}$", "$ABA^{-1}$", "$B^{-1}A$", "$B^{-1}A^{-2}$"],
    correctAnswer: "$B^{-1}A^{-1}$"
  },
  {
    id: 19,
    question: "যদি A একটি ডায়াগোনাল ম্যাট্রিক্স হয়, তবে এর নির্ণায়ক =",
    options: ["সকল উপাদানের যোগফল", "সকল উপাদানের গুণফল", "মধ্যবর্তী উপাদান", "0", "1"],
    correctAnswer: "সকল উপাদানের গুণফল"
  },
  {
    id: 20,
    question: "স্কয়ার ম্যাট্রিক্স A এর জন্য যদি $A^{2}=I$ হয়, তবে A কে কী বলা হয়?",
    options: ["ইউনিট ম্যাট্রিক্স", "অর্ডার ম্যাট্রিক্স", "ইনভলিউটরি", "স্কেলার", "ডায়াগোনাল"],
    correctAnswer: "ইনভলিউটরি"
  },
  {
    id: 21,
    question: "A ম্যাট্রিক্সের ডিটারমিন্যান্ট ১ হলে A কে কী বলা হয়?",
    options: ["ইউনিমডুলার", "স্কেলার", "ইনভার্টিবল", "সিমেট্রিক", "সিংগুলার"],
    correctAnswer: "ইউনিমডুলার"
  },
  {
    id: 22,
    question: "$A=[[2,-3],$ [1, 4]], A এর ট্রেস কত?",
    options: ["6", "1", "-1", "2", "7"],
    correctAnswer: "6"
  },
  {
    id: 23,
    question: "যদি A ট্রায়াঙ্গুলার ম্যাট্রিক্স হয়, তবে নির্ণায়ক =",
    options: ["সকল উপাদানের যোগফল", "সকল উপাদানের গুণফল", "ডায়াগোনাল উপাদানের গুণফল", "0", "1"],
    correctAnswer: "ডায়াগোনাল উপাদানের গুণফল"
  },
  {
    id: 24,
    question: "কোন ধরণের ম্যাট্রিক্সে সব উপাদান প্রধান কর্ণে থাকে?",
    options: ["ডায়াগোনাল", "স্কয়ার", "স্কেলার", "ইউনিট", "ব্ল্যাঙ্ক"],
    correctAnswer: "ডায়াগোনাল"
  },
   {
    id: 25,
    question: "একটি ম্যাট্রিক্স যার ইনভার্স নিজেই, সেটি হলো:",
    options: ["ইউনিট", "ইনভলিউটরি", "সিমেট্রিক", "ডায়াগোনাল", "অর্থোগোনাল"],
    correctAnswer: "ইনভলিউটরি"
  },
];